<template>
  <section class="section">
    <div class="container">
      <h2 class="section__title text-center" v-html="title"></h2>

      <div class="section__faq">
        <template v-for="(item, index) in faqList">
          <FaqItem
            :key="index"
            :title="item.title"
            :text="item.text"
            :active="item.active"
          />
        </template>
      </div>

      <FormBlock2
        :bgSrc="formBlock.bgSrc"
        :imgSrc="formBlock.imgSrc"
        :title="formBlock.title"
        :text="formBlock.text"
        :formProps="formBlock.formProps"
        :hint="formBlock.hint"
      />
    </div>
  </section>
</template>

<script>
import FaqItem from '@/components/Base/FaqItem.vue';
import FormBlock2 from '@/components/Base/FormBlock2.vue';

export default {
  name: 'Section8',
  components: {
    FaqItem,
    FormBlock2,
  },
  data() {
    return {
      title: 'Остались вопросы?',
      faqList: [
        {
          title: 'Популярный вопрос, не освещенный на сайте',
          text: `
            Проверим готовый (типовой или индивидуальный) проект дома. Сэкономим деньги,
            силы и нервы. Проверку осуществляет строительный консультант - ведущий
            специалист загородного домостроения. Проверим готовый (типовой или индивидуальный)
            проект дома. Сэкономим деньги, силы и нервы. Проверку осуществляет строительный
            консультант - ведущий специалист загородного домостроения. Проверим готовый
            (типовой или индивидуальный) проект дома. Сэкономим деньги, силы и нервы.
            Проверку осуществляет строительный консультант - ведущий специалист загородного
            домостроения.
          `,
          active: true,
        },
        {
          title: 'Популярный вопрос, не освещенный на сайте',
          text: `
            Проверим готовый (типовой или индивидуальный) проект дома. Сэкономим деньги,
            силы и нервы. Проверку осуществляет строительный консультант - ведущий
            специалист загородного домостроения. Проверим готовый (типовой или индивидуальный)
            проект дома. Сэкономим деньги, силы и нервы. Проверку осуществляет строительный
            консультант - ведущий специалист загородного домостроения. Проверим готовый
            (типовой или индивидуальный) проект дома. Сэкономим деньги, силы и нервы.
            Проверку осуществляет строительный консультант - ведущий специалист загородного
            домостроения.
          `,
          active: false,
        },
        {
          title: 'Популярный вопрос, не освещенный на сайте',
          text: `
            Проверим готовый (типовой или индивидуальный) проект дома. Сэкономим деньги,
            силы и нервы. Проверку осуществляет строительный консультант - ведущий
            специалист загородного домостроения. Проверим готовый (типовой или индивидуальный)
            проект дома. Сэкономим деньги, силы и нервы. Проверку осуществляет строительный
            консультант - ведущий специалист загородного домостроения. Проверим готовый
            (типовой или индивидуальный) проект дома. Сэкономим деньги, силы и нервы.
            Проверку осуществляет строительный консультант - ведущий специалист загородного
            домостроения.
          `,
          active: false,
        },
        {
          title: 'Популярный вопрос, не освещенный на сайте',
          text: `
            Проверим готовый (типовой или индивидуальный) проект дома. Сэкономим деньги,
            силы и нервы. Проверку осуществляет строительный консультант - ведущий
            специалист загородного домостроения. Проверим готовый (типовой или индивидуальный)
            проект дома. Сэкономим деньги, силы и нервы. Проверку осуществляет строительный
            консультант - ведущий специалист загородного домостроения. Проверим готовый
            (типовой или индивидуальный) проект дома. Сэкономим деньги, силы и нервы.
            Проверку осуществляет строительный консультант - ведущий специалист загородного
            домостроения.
          `,
          active: false,
        },
        {
          title: 'Популярный вопрос, не освещенный на сайте',
          text: `
            Проверим готовый (типовой или индивидуальный) проект дома. Сэкономим деньги,
            силы и нервы. Проверку осуществляет строительный консультант - ведущий
            специалист загородного домостроения. Проверим готовый (типовой или индивидуальный)
            проект дома. Сэкономим деньги, силы и нервы. Проверку осуществляет строительный
            консультант - ведущий специалист загородного домостроения. Проверим готовый
            (типовой или индивидуальный) проект дома. Сэкономим деньги, силы и нервы.
            Проверку осуществляет строительный консультант - ведущий специалист загородного
            домостроения.
          `,
          active: false,
        },
      ],
      formBlock: {
        bgSrc: require('@/assets/img/formBlock2/bg.jpg'),
        imgSrc: require('@/assets/img/formBlock2/img.png'),
        title: 'Не нашли ответ на интересующий Вас вопрос?',
        text: 'Оставьте номер телефона, мы свяжемся с Вами и ответим на все вопросы',
        formProps: {
          items: [
            {
              name: 'phone',
              placeholder: 'Ваш телефон',
              required: true,
              type: 'tel',
              value: '',
              mask: '+7 (999) 999-99-99',
              pattern: '^\\+7\\s\\([0-9]{3}\\)\\s[0-9]{3}-[0-9]{2}-[0-9]{2}$',
              title: '+7 (___) ___-__-__',
            },
          ],
          btnName: 'Есть вопросы',
          id: 'faq',
        },
        hint: 'Вы можете задать любой вопрос по строительству домов. Это ни к чему не обязывает.',
      },
    };
  },
};
</script>

<style lang="scss" scoped>
  .section {
    background-color: #FBFBFB;
    background-image: url(~@/assets/img/block8/bg-left-1.png),
      url(~@/assets/img/block8/bg-left-2.png);
    background-repeat: no-repeat;
    background-position: calc(100% - 55px) 15px, calc(100% - 30px) 535px;
    padding: 92px 0;

    &__title {
      margin-bottom: 34px;
    }

    &__faq {
      margin-bottom: 71px;
    }
  }
</style>
