<template>
  <section class="section">
    <div class="container">
      <h2 class="section__title text-center" v-html="title"></h2>

      <div class="row section__tabs">
        <template v-for="(item, index) in tabs">
          <div class="col-sm-6 col-md-4 col-lg-3 mb-4" :key="index">
            <Tab
              :name="item.name"
              :active="index === tabActive - 1"
              @click.native.prevent="tabActive = index + 1"
            />
          </div>
        </template>
      </div>

      <template v-for="(item, index) in tabs">
        <ServicesItem
          :key="index"
          :imgSrc="item.imgSrc"
          :title="item.title"
          :text="item.text"
          :price="item.price"
          :deadline="item.deadline"
          :list="item.list"
          v-if="index === tabActive - 1"
        />
      </template>
    </div>
  </section>
</template>

<script>
import Tab from '@/components/Base/Tab.vue';
import ServicesItem from '@/components/Base/ServicesItem.vue';

export default {
  name: 'Section10',
  components: {
    Tab,
    ServicesItem,
  },
  data() {
    return {
      title: 'Чем еще можем помочь',
      tabActive: 1,
      tabs: [
        {
          name: 'Исследование грунтов',
          title:
            `
              Инженерно геологические изыскания для
              <br>строительства дома
            `,
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
        {
          name: 'Название услуги',
          title: 'Название услуги',
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
        {
          name: 'Название услуги',
          title: 'Название услуги',
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
        {
          name: 'Название услуги',
          title: 'Название услуги',
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
        {
          name: 'Название услуги',
          title: 'Название услуги',
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
        {
          name: 'Название услуги',
          title: 'Название услуги',
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
        {
          name: 'Название услуги',
          title: 'Название услуги',
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
        {
          name: 'Название услуги',
          title: 'Название услуги',
          imgSrc: require('@/assets/img/services/img-1.jpg'),
          price: 'от 15 000 ₽',
          deadline: '1 день',
          text: '<b>Работы по геологическим изысканиям для строительства коттеджа включают:</b>',
          list: [
            `
              бурение скважин и отбор проб грунта для изучения геологического разреза,
              определения уровня грунтовых вод и проведения лабораторных исследований;
            `,
            `
              проведение лабораторных исследований отобранных образцов: изучение
              физико-механических, агрессивных и коррозионных свойств грунтов, определение
              химического состава грунтовых вод;
            `,
            `
              камеральная обработка результатов полевых исследований и лабораторных испытаний,
              составление технического отчета.
            `,
          ],
        },
      ],
    };
  },
};
</script>

<style lang="scss" scoped>
  .section {
    background-color: #F5F5F5;;
    background-image: url(~@/assets/img/block10/bg-left.png),
      url(~@/assets/img/block10/bg-right.png);
    background-repeat: no-repeat;
    background-position: 25px calc(100% - 79px), calc(100% - 76px) 358px;
    padding: 92px 0;

    &__title {
      margin-bottom: 40px;
    }

    &__tabs {
      margin-bottom: 76px;
    }
  }
</style>
